

#ifndef _UMASS_H_INCLUDED
#define _UMASS_H_INCLUDED


struct _umass_sim_priv
{
    int fill_0[4]; //0
    char* Data_0x10; //0x10
    uint32_t Data_0x14; //0x14
    int Data_0x18; //0x18
    //???
};


struct Struct_10416c
{
    SIM_HBA* Data_0; //0 0x1c
    usbd_device_instance_t Data_4; //4 0x20 +0x24
    struct usbd_device* Data_0x28; //0x28 0x44
    int Data_0x2c; //0x2c 0x48
    int fill_0x30; //0x30
    uint32_t Data_0x34; //0x34 
    int Data_0x38; //0x38
    uint16_t fill_0x3c; //0x3c
    uint8_t bData_0x3e; //0x3e
    uint16_t fill_0x40; //0x40
    uint8_t bData_0x42; //0x42
    int Data_0x44; //0x44
    int fill_0x48; //0x48
    int Data_0x4c; //0x4c
    int Data_0x50; //0x50
    int fill_0x54; //0x54
    int Data_0x58; //0x58
    int Data_0x5c; //0x5c
    int fill_0x60; //0x60
    uint8_t fill_0x64; //0x64
    uint8_t bData_0x65; //0x65
    int fill_0x68[3]; //0x68
    uint8_t bData_0x74; //0x74
    uint16_t fill_0x76; //0x76
    uint8_t bData_0x78; //0x78
    int fill_0x7c[2]; //0x7c
    int Data_0x84; //0x84
    int fill_0x88[16]; //0x88
    void* Data_0xc8; //0xc8
    void* Data_0xcc; //0xcc
    void* Data_0xd0; //0xd0
    struct usbd_pipe* Data_0xd4; //0xd4
    struct usbd_pipe* Data_0xd8; //0xd8
    struct usbd_pipe* Data_0xdc; //0xdc
    struct usbd_pipe* Data_0xe0; //0xe0
    void* Data_0xe4; //0xe4
    int Data_0xe8; //0xe8
    int Data_0xec; //0xec
    struct usbd_urb* Data_0xf0; //0xf0
    struct usbd_urb* Data_0xf4; //0xf4
    struct usbd_urb* Data_0xf8; //0xf8
    struct usbd_urb* Data_0xfc; //0xfc
    struct usbd_urb* Data_0x100; //0x100
    usbd_urb_sg_elem_t* Data_0x104; //0x104
    //0x108
};



typedef struct _sim_umass_ext {
    int fill_0[2]; //0
    pthread_mutex_t Data_8; //8
    CCB_SCSIIO* Data_0x10; //0x10
    uint32_t Data_0x14; //0x14
    uint32_t Data_0x18; //0x18
    struct Struct_10416c Data_0x1c; //0x1c +0x108 = 0x124
    void (*Data_0x124)(struct _sim_umass_ext*, CCB_SCSIIO*); //0x124
    void (*Data_0x128)(); //0x128
    //0x12c
} SIM_UMASS_EXT;




#endif
