
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <stdarg.h>
#include <unistd.h>
#include <errno.h>
#include <gulliver.h>
#include <sys/mman.h>
#include <sys/neutrino.h>
#include <sys/netmgr.h>
#include <sys/slog.h>
#include <sys/usbdi.h>
#include <pthread.h>
#include <queue.h>
#include <arm/mb86h60.h>


//_GLOBAL_OFFSET_TABLE_ //0x0000bd5c

struct Mentor_Controller;
#define USB_CONTROLLER_PRIV_T struct Mentor_Controller
#include <sys/io-usb.h>
#include "my-io-usb.h"



struct Struct_0xa4;
struct _musb_transfer;
struct Struct_0x94
{
    struct _musb_transfer* Data_0; //0
};

struct _musb_transfer
{
    volatile uint32_t xfer_length; //0
    volatile uint32_t flags; //4
    int Data_8; //8
    uint32_t xfer_buffer; //0xc
    int Data_0x10; //0x10
    volatile uint32_t bytes_xfered; //0x14
    int Data_0x18; //0x18
    int Data_0x1c; //0x1c
    int Data_0x20; //0x20
    int Data_0x24; //0x24
    int status; //0x28
    SIMPLEQ_ENTRY(_musb_transfer) link; //0x2c
    struct Struct_0xa4* Data_0x30; //0x30
    struct Struct_10bab4* Data_0x34; //0x34
    void (*Func_0x38)(); //0x38
    void (*Data_0x3c)(); //0x3c
    int fill_0x40; //0x40
    //0x44
};


struct Struct_0xa4
{
    struct Struct_0xa4* Data_0; //0
    struct Struct_0xa4* Data_4; //4
    struct _musb_transfer* Data_8__; //8
    struct Struct_0x94* Data_0xc; //12
    int Data_0x10; //0x10 = 16
    int Data_0x14; //0x14 = 20
    uint16_t wData_0x18; //0x18 = 24
    uint8_t transferType; //0x1a = 26
    uint8_t bData_0x1b; //0x1b = 27
    uint8_t bData_0x1c; //0x1c = 28
    uint8_t bData_0x1d; //0x1d = 29
    uint8_t bData_0x1e; //0x1e = 30
    uint8_t bData_0x1f; //0x1f = 31
    int Data_0x20; //0x20
    int Data_0x24; //0x24
    int Data_0x28; //0x28
    int Data_0x2c; //0x2c
    struct fp_0x34_Inner_0x18_Inner_0x10* Data_0x30; //0x30
    struct Struct_112b08* Data_0x34; //0x34
    int Data_0x38; //0x38
    void* Data_0x3c; //0x3c
    //0x40 = 64
};
    


struct _bdbase
{
    struct _bdbase_inner 
    {
        int fill_0[13]; //0
        int Data_0x34; //0x34
        int Data_0x38; //0x38
        int fill_0x3c; //0x3c
        //0x40
    } Data_0[241]; //0 +0xf1 * 0x40 = 0x3c40
    //0x3c40
};


struct Struct_0xe4_Inner_0x1c
{
    int fill_0[3]; //0
    int Data_0xc; //0xc
    int fill_0x10[6]; //0x10
    uint32_t Data_0x28; //0x28
    struct _musb_transfer* Data_0x2c; //0x2c
    struct
    {
        int fill_0[10]; //0
        int Data_0x28; //0x28
        //
    }* Data_0x30; //0x30
#if 0
    struct Struct_0xe4_Inner_0x1c* le_next; //0x34
    struct Struct_0xe4_Inner_0x1c** le_prev; //0x38
#else
    LIST_ENTRY(Struct_0xe4_Inner_0x1c) link; //0x34
#endif
    //???
};


struct Struct_0xe4
{
    void* Data_0; //0
    void* Data_4__; //4
    struct _bdbase* Data_8; //8
    uint8_t bData_0xc; //0xc
    int Data_0x10; //0x10
    int Data_0x14; //0x14
//    struct _bdbase_inner* Data_0x18; //0x18
    LIST_HEAD(, Struct_0xe4_Inner_0x1c) Data_0x18; //0x18
    LIST_HEAD(, Struct_0xe4_Inner_0x1c) Data_0x1c; //0x1c
    //0x20
};


struct Mentor_Controller_Inner_0x8c
{
    int fill_0[6]; //0
    struct fp_0x34_Inner_0x18
    {
        int fill_0[2]; //8
        int Data_8; //8
        uint32_t Data_0xc; //12 = 0xc
        struct fp_0x34_Inner_0x18_Inner_0x10
        {
            int Data_0; //0
            int Data_4; //4
            int Data_8; //8
            struct fp_0x34_Inner_0x18* Data_0xc; //0xc 
            //16 = 0x10
        }* Data_0x10; //16 = 0x10
        //0x14
    } Data_0x18[]; //0x18, size???
    //???
};


struct Mentor_Controller
{
    struct USB_Controller* Data_0; //0
    pthread_mutex_t Data_4; //4
    pthread_mutex_t Data_0xc; //12
    void* Data_0x14; //0x14
    uint32_t Data_0x18; //0x18
    int fill_ox1c[3]; //0x1c
    int Data_0x28; //0x28
    int Data_0x2c; //0x2c
    int fill_0x30[2]; //0x30
    int Data_0x38; //0x38
    pthread_t Data_0x3c; //0x3c
    int Data_0x40; //0x40
    int Data_0x44; //0x44
    int irq; //0x48
    int intr_id; //0x4c
    int flags; //0x50
    int Data_0x54; //0x54
    int Data_0x58; //0x58
    struct sigevent Data_0x5c;
    int Data_0x6c; //0x6c
    uint32_t Data_0x70; //0x70
    uint32_t num_td; //0x74
    uint32_t verbosity; //0x78
    int Data_0x7c; //0x7c
    int fill_0x80; //0x80
    int Data_0x84; //0x84
    char* fconfig_string; //0x88
    struct Mentor_Controller_Inner_0x8c* Data_0x8c; //0x8c
    SIMPLEQ_HEAD(, _musb_transfer) transfer_free_q; //0x90
    SIMPLEQ_HEAD(, _musb_transfer) transfer_complete_q; //0x98
    void* transfer_mem; //0xa0
    struct Struct_0xa4* Data_0xa4; //0xa4
    struct Struct_0xa4* Data_0xa8; //0xa8
    struct Struct_0xa4* Data_0xac; //0xac
    struct Struct_0xa4* Data_0xb0; //0xb0
    struct Struct_0xa4* Data_0xb4; //0xb4
    struct Struct_0xa4* Data_0xb8; //0xb8
    struct Struct_0xa4* Data_0xbc; //0xbc
    struct Struct_0xa4* Data_0xc0; //0xc0
    struct _musb_transfer** Data_0xc4; //0xc4
    struct Struct_0xa4** Data_0xc8; //0xc8
    int fill_0xcc; //0xcc
    struct intrspin Data_0xd0; //0xd0
    uint16_t wData_0xd4; //0xd4
    struct Struct_0xe4* Data_0xe4; //0xe4
    //0xe8
};

#include "mentor.h"
#include "mu_hdrdf.h"


extern void MENTOR_LoadFIFO(struct Mentor_Controller*, uint16_t, int, uint16_t);
extern void MENTOR_ReadFIFO(struct Mentor_Controller*, struct _musb_transfer*, uint16_t, int, uint16_t);


#ifndef MB86H60

int dma_nums = 0; //0x0000c010
int g_dma_nums = 0; //0x0000c014
uint8_t usbss_intstat_Val[2]; //0x0000c018
uint32_t g_usb_tx_intr[2]; //0x0000c01c
struct _bdbase* g_bdbase; //0x0000c028, size???
uint32_t g_usb_rx_intr[2]; //0x0000c02c

#endif


#ifdef MB86H60

volatile uint8_t bUsbIntStatus;

void* dma_regs = NULL;
uint32_t dma_dwUsbMode = 0;


void dma_SetUsbIntMask(struct Mentor_Controller* c, int a)
{
    ((volatile uint32_t*)(dma_regs))[MB86H60_DMA_USB_INT_MASK/sizeof(uint32_t)] = a;
}

uint32_t dma_GetUsbIntStatus(struct Mentor_Controller* c)
{
    return ((volatile uint32_t*)(dma_regs))[MB86H60_DMA_USB_INT_STATUS/sizeof(uint32_t)];
}

void dma_SetUsbIntClear(struct Mentor_Controller* c, int a)
{
    ((volatile uint32_t*)(dma_regs))[MB86H60_DMA_USB_INT_CLEAR/sizeof(uint32_t)] = a;
}

void dma_SetUsbMode_LengthInput(struct Mentor_Controller* c, int a)
{
	int mask = MB86H60_DMA_USB_MODE_LENGTH_INPUT;
	a = (a << 1) & mask;

	dma_dwUsbMode = (dma_dwUsbMode & ~mask) | a;

    ((volatile uint32_t*)(dma_regs))[MB86H60_DMA_USB_MODE/sizeof(uint32_t)] = dma_dwUsbMode;
}

void dma_SetUsbMode_PacedEpWriteChannel(struct Mentor_Controller* c, uint32_t value)
{
    uint32_t mask = MB86H60_DMA_USB_MODE_PACED_EP_WRITE_CHANNEL;
    value = (value << 3) & mask;

    dma_dwUsbMode = (dma_dwUsbMode & ~mask) | value;

    ((volatile uint32_t*)(dma_regs))[MB86H60_DMA_USB_MODE/sizeof(uint32_t)] = dma_dwUsbMode;
}


void dma_SetUsbMode_PacedEpReadChannel(struct Mentor_Controller* c, uint32_t value)
{
    uint32_t mask = MB86H60_DMA_USB_MODE_PACED_EP_READ_CHANNEL;
    value = (value << 5) & mask;

    dma_dwUsbMode = (dma_dwUsbMode & ~mask) | value;

    ((volatile uint32_t*)(dma_regs))[MB86H60_DMA_USB_MODE/sizeof(uint32_t)] = dma_dwUsbMode;
}


uint8_t MGC_Read8(struct Mentor_Controller* c, uint16_t offset)
{
    uint8_t data;
	dma_SetUsbMode_LengthInput(c, 0);
    data = ((volatile uint32_t*)(c->Data_0x14))[offset];
    return data;
}


uint16_t MGC_Read16(struct Mentor_Controller* c, uint16_t offset)
{
    uint16_t data;
	dma_SetUsbMode_LengthInput(c, 1);
    data = ((volatile uint32_t*)(c->Data_0x14))[offset];
    return data;
}


uint32_t MGC_Read32(struct Mentor_Controller* c, uint16_t offset)
{
    uint32_t data;
	dma_SetUsbMode_LengthInput(c, 2);
    data = ((volatile uint32_t*)(c->Data_0x14))[offset];
    return data;
}


void MGC_Write8(struct Mentor_Controller* c, uint16_t offset, uint8_t data)
{
	dma_SetUsbMode_LengthInput(c, 0);
    ((volatile uint32_t*)(c->Data_0x14))[offset] = data;
}


void MGC_Write16(struct Mentor_Controller* c, uint16_t offset, uint16_t data)
{
	dma_SetUsbMode_LengthInput(c, 1);
    ((volatile uint32_t*)(c->Data_0x14))[offset] = data;
}


void MGC_Write32(struct Mentor_Controller* c, uint16_t offset, uint32_t data)
{
	dma_SetUsbMode_LengthInput(c, 2);
    ((volatile uint32_t*)(c->Data_0x14))[offset] = data;
}

#endif //MB86H60



/* 0x0000611c - complete */
int mentor_slogf(struct Mentor_Controller* a, 
        int opcode, int severity, int verbosity,
        const char* fmt, ...)
{
    int res;

    if (a->verbosity < verbosity)
    {
        return 0;
    }

    va_list arglist;

    va_start(arglist, fmt);
#if 0
    res = vslogf(opcode, severity, fmt, arglist);
#else
    res = vfprintf(stderr, fmt, arglist);
    fprintf(stderr, "\n");
#endif
    va_end( arglist );
    return res;
}


/* 0x00004cbc - todo */
void MENTOR_ProcessControlDone(struct Mentor_Controller* r5)
{
#if 0
    fprintf(stderr, "MENTOR_ProcessControlDone: TODO\n");
#endif

    struct _musb_transfer* r4 = r5->Data_0xc4[0];
    if (r4 == NULL)
    {
        //->loc_4ee8
        return;
    }

    struct Struct_0xa4* r6 = r4->Data_0x30;
    
    if (r6->bData_0x1f != 0)
    {
        //->loc_4ee8
        return;
    }
    //0x00004cf0
    int status; //r8
    uint16_t wCsr; //r7

    wCsr = HW_Read16(r5, MUSB_CSR0);

    status = (wCsr & (1 << 2)/*RxStall*/)? USBD_STATUS_STALL: 0;

    if (wCsr & ((1 << 7)/*NAK Timeout*/ | (1 << 4)/*Error*/))
    {
        status = USBD_STATUS_NOT_ACCESSED;
        //->loc_4e3c
    }
    //0x00004d10
    if (status == 0)
    {
        //0x00004d18
        if (r4->flags & PIPE_FLAGS_TOKEN_IN) //4)
        {
            //0x00004d24
            uint16_t sl;
            sl = HW_Read16(r5, MUSB_COUNT0);
#if 0 //No printf in ISR
            fprintf(stderr, "MENTOR_ProcessControlDone: sl=%d\n", sl);
#endif
            int sb = sl;

            if (sl > (uint32_t)(r4->xfer_length - r4->bytes_xfered))
            {
                status = USBD_STATUS_DATA_OVERRUN;
                //->0x00004e3c
            }
            else if (/*sl*/sb > 0)
            {
                //0x00004d50
                MENTOR_ReadFIFO(r5, r4, 0, 
                    r4->xfer_buffer + r4->bytes_xfered,
                    sl);

                r4->bytes_xfered += sl;

                if ((r6->wData_0x18 == sl) && (r4->xfer_length > r4->bytes_xfered))
                {
                    //0x00004d94
                    HW_Write16(r5, MUSB_CSR0, wCsr | 0x20);
                    //->loc_4ee8
                    return;
                }
                //0x00004e3c
            }
            //->0x00004e3c
        } //if (r4->flags & PIPE_FLAGS_TOKEN_IN) //4)
        //loc_4dac
        else if (r4->flags & PIPE_FLAGS_TOKEN_OUT) //8)
        {
            //0x00004db8
            if (r4->xfer_length > r4->bytes_xfered)
            {
                //0x00004dc8
                uint32_t r6_ = r6->wData_0x18;
                if (r6_ >= (r4->xfer_length - r4->bytes_xfered))
                {
                    r6_ = r4->xfer_length - r4->bytes_xfered;
                }

                MENTOR_LoadFIFO(r5, 0, 
                    r4->xfer_buffer + r4->bytes_xfered,
                    r6_);

                r4->bytes_xfered += r6_;

                HW_Write16(r5, MUSB_CSR0, HW_Read16(r5, MUSB_CSR0) | 0x02);
                //->loc_4ee8
                return;
            }
            //loc_4e3c
        } //else if (r4->flags & PIPE_FLAGS_TOKEN_OUT) //8)
        //loc_4e2c
        else if (r4->flags & PIPE_FLAGS_TOKEN_SETUP) //1)
        {
            r4->bytes_xfered = r4->xfer_length;
        } //else if (r4->flags & 1)
    } //if (status == 0)
    //loc_4e3c
    r6->Data_0x20 = (wCsr >> 9) & 1;

    HW_Write16(r5, MUSB_CSR0, 0);

    InterruptLock(&r5->Data_0xd0);

    r5->Data_0xc4[0] = NULL;

    r6->Data_8__ = SIMPLEQ_NEXT(r4, link);
    if (r6->Data_8__ == 0)
    {
        r6->Data_0xc = &r6->Data_8__;
    }
    r6->Data_0x10 &= ~0x01;

    r4->status = status;

    SIMPLEQ_INSERT_TAIL(&r5->transfer_complete_q, r4, link);

    InterruptUnlock(&r5->Data_0xd0);
    //loc_4ee8
    return;
}


/* 0x00004220 - todo */
struct fp_0x34_Inner_0x18_Inner_0x10* mentor_fifo_alloc(struct Mentor_Controller* r5,
        int fp_0x2c, 
        struct Struct_0xa4* c,
        int fp_0x30)
{
#if 0
    fprintf(stderr, "mentor_fifo_alloc: TODO!!!\n");
#endif

    struct fp_0x34_Inner_0x18_Inner_0x10* r0 = NULL;
    int r8;
    uint32_t r3;
    struct Mentor_Controller_Inner_0x8c* r4 = r5->Data_0x8c;
    int r6 = c->wData_0x18;
    //r7 = 0x24;
    //sb = 0x20;
    //->loc_4364
    while ((r8/*r0*/ = find_block_list(r4, r6)) != -1)
    {
        //loc_4250
#if 1
        fprintf(stderr, "mentor_fifo_alloc: r6=%d, fifo_size=%d\n", r6, r8);
#endif
        uint32_t sl = r4->Data_0x18[r8].Data_0xc;
        for (r3 = 0; r3 < r4->Data_0x18[r8].Data_8; r3++)
        {
#if 1
            fprintf(stderr, "mentor_fifo_alloc: r3=%d, sl=0x%04x\n", r3, sl);
#endif
            //if (sl & (1 << r3))
            if (sl & 1)
            {
                r4->Data_0x18[r8].Data_0xc = sl & ~(1 << r3);

#if 1
                fprintf(stderr, "mentor_fifo_alloc: fp_0x30=%d, ep=%d, fifo_add=%d\n", 
                    fp_0x30, fp_0x2c, r4->Data_0x18[r8].Data_0x10[r3].Data_4);
#endif

#ifdef MB86H60
                //MGC_SelectEnd(r5, fp_0x2c & 0xff);
                MGC_Write8(r5, MGC_O_HDRC_INDEX, fp_0x2c & 0xff);
#else
                ((volatile uint8_t*)(r5->Data_0x14))[0x0e/*INDEX*/] = fp_0x2c & 0xff;
#endif

                if (fp_0x30 != 0)
                {
                    //0x000042c0
#ifdef MB86H60
#if 0 //Dynfifo!
                    MGC_Write8(r5, MGC_O_HDRC_RXFIFOSZ, r8/*r0*/ & 0xff);
                    HW_Write16(r5, MGC_O_HDRC_RXFIFOADD, 
                        (r4->Data_0x18[r8].Data_0x10[r3].Data_4 << 13) >> 16);
#endif
#else
                    ((volatile uint8_t*)(r5->Data_0x14))[0x63/*RXFIFOSZ*/] = r8/*r0*/ & 0xff;
                    ((volatile uint16_t*)(r5->Data_0x14))[0x66/2/*RXFIFOADD*/] = 
                        (r4->Data_0x18[r8].Data_0x10[r3].Data_4 << 13) >> 16;
#endif
                    //->loc_4334
                }
                else
                {
                    //loc_42fc
#ifdef MB86H60
#if 0 //Dynfifo!
                    MGC_Write8(r5, MGC_O_HDRC_TXFIFOSZ, r8/*r0*/ & 0xff);
                    HW_Write16(r5, MGC_O_HDRC_TXFIFOADD, 
                        (r4->Data_0x18[r8].Data_0x10[r3].Data_4 << 13) >> 16);
#endif
#else
                    ((volatile uint8_t*)(r5->Data_0x14))[0x62/*TXFIFOSZ*/] = r8/*r0*/ & 0xff;
                    ((volatile uint16_t*)(r5->Data_0x14))[0x64/2/*TXFIFOADD*/] = 
                        (r4->Data_0x18[r8].Data_0x10[r3].Data_4 << 13) >> 16;
#endif
                }
                //loc_4334
                r0 = &r4->Data_0x18[r8].Data_0x10[r3];
                //->loc_437c
                return r0;
            }
            
            sl >>= 1;
        } //for (r3 = 0; r3 < r4->Data_0x18[r8].Data_8; r3++)
        //loc_4360
        r6 *= 2;
    } //while ((r8/*r0*/ = find_block_list(r4, r6)) != -1)
    //0x00004378
    return r0;
}


/* 0x00008284 - todo */
int MENTOR_AllocEtd(struct Mentor_Controller* r5, 
        struct Struct_0xa4* r6, 
        int r8)
{
#if 1
    fprintf(stderr, "MENTOR_AllocEtd: TODO!!!\n");
#endif

    int r4 = r6->Data_0x28;
    if ((r4 > 0) && (r4 < r5->Data_0x18))
    {
        //->loc_84f0
        return r4;
    }
    //loc_82b4
    for (r4 = 1; (r4 < r5->Data_0x18) && (r5->Data_0xc8[r4] != NULL); r4++)
    {
    }

    if (r4 >= r5->Data_0x18)
    {
        //loc_8304
        int r3 = r5->wData_0xd4;
        if (r3 != 0)
        {
            //0x00008310
            for (r4 = 1; (r4 < r5->Data_0x18) && 
                (r5->Data_0xc8[r4]->Data_0x10 & 0x01); r4++)
            {
                //loc_832c
            }

            if (r4 >= r5->Data_0x18)
            {
                //->loc_84ec
                return -1;
            }
            //loc_8344
            if (MENTOR_FreeEtd(r5, r5->Data_0xc8[r4]) < 0)
            {
                //0x000083f8
                mentor_slogf(r5, 12, 2, 1, 
                    "%s - %s: Trying to relinquish an unreserved ETD failed",
                    "devu-dm816x-mg.so", "MENTOR_AllocEtd");
            }
            //loc_8390
            r5->wData_0xd4 = 0;
            //->loc_8464
        }
        else
        {
            //loc_83b8
            for (r4 = 1; (r4 < r5->Data_0x18) && 
                (r5->Data_0xc8[r4]->Data_0x10 & 0x01); r4++)
            {
            }

            if (r4 >= r5->Data_0x18)
            {
                //->loc_84ec
                return -1;
            }
            //loc_83e8
            if (MENTOR_FreeEtd(r5, r5->Data_0xc8[r4]) < 0)
            {
                //0x000083f8
                mentor_slogf(r5, 12, 2, 1, 
                    "%s - %s: Trying to relinquish an unreserved ETD failed",
                    "devu-dm816x-mg.so", "MENTOR_AllocEtd");
            }
            //loc_8434
            r5->wData_0xd4 = 1;
            //->loc_8464
        }
    }
    //loc_8464
    r6->Data_0x30 = mentor_fifo_alloc(r5, r4, r6, r8);
    if (r6->Data_0x30 == 0)
    {
        //0x00008484
        mentor_slogf(r5, 12, 2, 1, 
            "%s - %s: Allocate FIFO failed, bEnd=%d, maxPacketSize=%d",
            "devu-dm816x-mg.so", "MENTOR_AllocEtd",
            r4, r6->wData_0x18);

        r4 = -1;
        //->loc_84f0
    }
    else
    {
        //loc_84d4
        r6->Data_0x28 = r4;
        r6->bData_0x1f = 0;
        r5->Data_0xc8[r4] = r6;
    }
    //loc_84f0
    return r4;
}


void MENTOR_EtdConfigureTX(struct Mentor_Controller* a, 
    struct Struct_0xa4* b, int c)
{
#if 0
    fprintf(stderr, "MENTOR_EtdConfigureTX: TODO!!!\n");
#endif

    int r4 = b->transferType;
    int r3 = c * 16;

    HW_Write16(a, 0x106 + r3, 0);

    if (b->Data_0x20 != 0)
    {
        //0x00004794
        HW_Write16(a, 0x102 + r3, 0x2308);
        //->loc_47c8
    }
    else
    {
        //loc_47b0
        HW_Write16(a, 0x102 + r3, 0x2048);
    }
    //loc_47c8
    int r2 = c * 8;

    HW_Write16(a, 0x80 + r2, (b->Data_0x14 >> 4) & 0x7f);

    if (b->bData_0x1c & 0x40)
    {
        //0x000047f4
        HW_Write8(a, 0x82 + r2, b->bData_0x1d);
        HW_Write8(a, 0x83 + r2, b->bData_0x1e);
    }
    //loc_481c
    HW_Write16(a, 0x10a + r3, 
        (r4 << 4) | (b->Data_0x14 & 0x0f) | b->bData_0x1c);
    
    if (r4 & 0x01)
    {
        //0x00004854
        HW_Write8(a, 0x10b + r3, b->Data_0x24);
    }
    else
    {
        //loc_4870
        HW_Write8(a, 0x10b + r3, 0);
    }
    //loc_4888
}


/* 0x00004898 - todo */
void MENTOR_EtdConfigureRX(struct Mentor_Controller* a, 
    struct Struct_0xa4* b, int c)
{
#if 1
    fprintf(stderr, "MENTOR_EtdConfigureRX: c=%d, addr=%d\n", 
        c, (b->Data_0x14 >> 4) & 0x7f);
#endif

    int r4 = b->transferType;
    int r3 = c * 16;

    HW_Write16(a, 0x102 + r3, 0);

    int r2 = c * 8;
#ifdef MB86H60
    MGC_Write8(a, 0x84 + c*8, (b->Data_0x14 >> 4) & 0x7f);
//    MGC_Write16(a, /*0x84 + r2*/MGC_BUSCTL_OFFSET(c, MGC_O_HDRC_RXFUNCADDR), 
//        (b->Data_0x14 >> 4) & 0x7f);
#else
    ((volatile uint16_t*)(a->Data_0x14))[0x84/2 + r2] = (b->Data_0x14 >> 4) & 0x7f;
#endif

    if (b->bData_0x1c != 0x40)
    {
        //0x000048e8
#ifdef MB86H60
        MGC_Write8(a, /*0x86 + r2*/MGC_BUSCTL_OFFSET(c, MGC_O_HDRC_RXHUBADDR), 
            b->bData_0x1d);
        MGC_Write8(a, /*0x87 + r2*/MGC_BUSCTL_OFFSET(c, MGC_O_HDRC_RXHUBPORT), 
            b->bData_0x1e);
#else
        ((volatile uint8_t*)(a->Data_0x14))[0x86 + r2] = b->bData_0x1d;
        ((volatile uint8_t*)(a->Data_0x14))[0x87 + r2] = b->bData_0x1e;
#endif
    }
    //loc_4910: Write RXTYPE
    uint8_t rxType = b->bData_0x1c | (r4 << 4) | (b->Data_0x14 & 0x0f);

#if 1
    fprintf(stderr, "MENTOR_EtdConfigureRX: rxType=0x%x, speed=0x%0x, protocol=%d, ep=%d\n", 
        rxType, b->bData_0x1c, r4, b->Data_0x14 & 0x0f);
#endif

#ifdef MB86H60
    MGC_Write8(a, 0x1c, rxType);
//    MGC_Write8(a, 0x10c + r3, rxType);
#else
    ((volatile uint8_t*)(a->Data_0x14))[0x10c + r3] = rxType;
#endif

#ifdef MB86H60
    MGC_Read16(a, 0x16);
//    int r2_ = MGC_Read16(a, 0x106 + r3);
#else
    int r2_ = ((volatile uint16_t*)(a->Data_0x14))[0x106/2 + r3];
#endif

    if (r4 & 0x01)
    {
#ifdef MB86H60
        MGC_Write8(a, 0x1d, b->Data_0x24); //RXINTERVAL
//        MGC_Write8(a, 0x10d + r3, b->Data_0x24); //RXINTERVAL
#else
        ((volatile uint8_t*)(a->Data_0x14))[0x10d + r3] = b->Data_0x24;
#endif
    }
    else
    {
#ifdef MB86H60
        MGC_Write8(a, 0x1b, 0); //TXINTERVAL

//        MGC_Write8(a, 0x10b + r3, 0); //TXINTERVAL
#else
        ((volatile uint8_t*)(a->Data_0x14))[0x10b + r3] = 0;
#endif
    }

    if (b->Data_0x20 != 0)
    {
        //0x0000497c
#ifdef MB86H60
        MGC_Write16(a, 0x16, 0x610);
//        MGC_Write16(a, 0x106 + r3, 0x610);
#else
        ((volatile uint16_t*)(a->Data_0x14))[0x106/2 + r3] = 0x610;
#endif
        //->loc_49b0
    }
    else
    {
        //loc_4998
#ifdef MB86H60
        MGC_Write16(a, 0x16, 0x90);
//        MGC_Write16(a, 0x106 + r3, 0x90);
#else
        ((volatile uint16_t*)(a->Data_0x14))[0x106/2 + r3] = 0x90;
#endif
    }
    //loc_49b0
#ifdef MB86H60
    MGC_Write16(a, 0x16, 0x10);
//    MGC_Write16(a, 0x106 + r3, 0x10);
#else
    ((volatile uint16_t*)(a->Data_0x14))[0x106/2 + r3] = 0x10;
#endif
}


/* 0x00006cc0 - todo */
void MENTOR_StartEtd(struct Mentor_Controller* r4, 
    struct _musb_transfer* r6)
{
#if 0
    fprintf(stderr, "MENTOR_StartEtd: TODO!!!\n");
#endif

    int ep; //fp_0x30;
    //fp_0x2c = _GLOBAL_OFFSET_TABLE_;

    struct Struct_0xa4* r8 = r6->Data_0x30;

#if 1
    fprintf(stderr, "MENTOR_StartEtd: r8=%p, r8->Data_0x28=%d\n",
        r8, r8->Data_0x28);
#endif

    if (r8->Data_0x28 >= 0)
    {
        //0x00006cf4
        r8->bData_0x1f = 0;

        ep = r8->Data_0x28;
        r4->Data_0xc4[ep] = r6;
        r6->flags |= 0x100;

        int r7 = ep * 16;

        uint16_t wCsr;
        int retry/*r5*/ = 1000;
        while (((wCsr = HW_Read16(r4, 0x102 + r7)) & 0x03) && retry--)
        {
            //loc_6d68
#if 0
            fprintf(stderr, "MENTOR_StartEtd: r7=%d, wCsr=0x%04x, retry=%d\n", r7, wCsr, retry);
#endif
            nanospin_ns(1000);
        }

#if 0
        fprintf(stderr, "MENTOR_StartEtd: r7=%d, wCsr=0x%04x, retry=%d\n", r7, wCsr, retry);
#endif

        if (retry <= 0)
        {
            //loc_6d9c
            mentor_slogf(r4, 12, 2, 1, 
                " %s : MENTOR_StartEtd - %s: TX FIFO still not Empty (%x)",
                "devu-dm816x-mg.so", "MENTOR_StartEtd", wCsr);
        }
        //loc_6de0
        int r5 = r6->xfer_length - r6->bytes_xfered;

#if 1
        fprintf(stderr, "MENTOR_StartEtd: r5=%d, r6->flags=0x%x\n",
            r5, r6->flags);
#endif

        if ((r6->flags & 0x400) &&
            (r4->flags & 0x200) &&
            (r5 > r8->wData_0x18) &&
            ((r8->wData_0x18 & 0x3f) == 0) &&
            (r8->transferType == USB_ATTRIB_BULK)) //2))
        {
            //0x00006e24
            r6->Data_0x10 = r5;
            r6->flags |= 0x800;
            //->loc_6e58
        }
        else
        {
            //loc_6e38
            r6->flags &= ~0x800;
            r6->Data_0x10 = (r5 > r8->Data_0x30->Data_0)?
                r8->Data_0x30->Data_0: r5;
        }
        //loc_6e58
        if (r6->flags & 0x04)
        {
            //0x00006e64
            int sb = HW_Read16(r4, 0x106 + r7);
#if 1
            fprintf(stderr, "MENTOR_StartEtd: 0x106 -> 0x%x\n", sb);
#endif

            if ((r8->transferType == USB_ATTRIB_ISOCHRONOUS/*1*/) || 
                (r8->transferType == USB_ATTRIB_INTERRUPT/*3*/))
            {
                sb |= (1 << 12); //0x1000; /* PID Error ?*/
            }

            if (r6->flags & 0x800)
            {
                //0x00006e94
                HW_Write16(r4, 0x104 + r7, r8->wData_0x18);
                HW_Write16(r4, 0x106 + r7, sb & 0x2792);

                if (r6->flags & 0x400)
                {
                    //0x00006ec8
#if 1
                    fprintf(stderr, "MENTOR_StartEtd: 0x00006ec8: TODO!!!\n");
#endif
                    //TODO!!!
                }
                //loc_6f00
                HW_Write16(r4, 0x106 + r7, 
                    HW_Read16(r4, 0x106 + r7) | 0x2040 | 0x2d);
                //->loc_71bc
            } //if (r6->flags & 0x800)
            else
            {
                //loc_6f24
                int fp_0x34;
                int fp_0x2c;

                fp_0x34 = fp_0x2c = r8->wData_0x18;
                int r0 = r6->Data_0x10 / r8->wData_0x18;
                int r3;
                if ((r0 - 1) <= 0)
                {
                    r3 = 0;
                    //->loc_6f58
                }
                else
                {
                    r3 = (r6->Data_0x10 / fp_0x34) - 1;
                }
                //loc_6f58: write RXMAXP
#if 1
                fprintf(stderr, "MENTOR_StartEtd: 0x104 <- 0x%x\n",
                    fp_0x2c | (r3 << 11));
#endif

                HW_Write16(r4, 0x104 + r7, fp_0x2c | (r3 << 11));

                int sl;
                if ((r6->flags & 0x400) == 0)
                {
                    sl = sb & 0x9fff;
                    //->loc_6fc8
                }
                else
                {
                    //0x00006f84
                    sl = sb & 0x2792;
                    sl |= (RXCSR_DMA_REQ_EN | RXCSR_AUTOREQ); //0x6000;

                    mentor_start_dma_transfer(r4,
                        r8,
                        r6,
                        1,
                        ep,
                        r8->Data_0x2c,
                        r6->Data_8 + r6->bytes_xfered,
                        r5);
                }
                //loc_6fc8: write RxCSR
#if 1
                fprintf(stderr, "MENTOR_StartEtd: 0x106 <- 0x%x\n",
                    sl | 0x6d);
#endif
                HW_Write16(r4, 0x106 + r7, sl | 0x6d); //01101101
                    //Clear: RxStall, DataError/NAK Timeout, Error, RxPktRdy
                    //Set: ReqPkt
            }
            //->loc_71bc
        } //if (r6->flags & 0x04)
        else
        {
            //loc_6fe4
            int32_t r0 = r6->Data_0x10;
            uint32_t sl = r8->wData_0x18;
            r0 = r0 - 1;
            r0 = r0 + sl;
            r0 = r0 / sl;
            r0 = r0 - 1;
            if (r0 <= 0)
            {
                r0 = 0; 
                //->loc_7024
            }
            else
            {
                //0x0000700c
                r0 = r6->Data_0x10;
                r0 = r0 - 1;
                r0 = r0 + sl;
                r0 = r0 / sl;
                r0 = r0 - 1;
            }
            //loc_7024
            int sb = HW_Read16(r4, 0x102 + r7);

            if (r6->flags & 0x600)
            {
                //0x00007044
#if 1
                fprintf(stderr, "MENTOR_StartEtd: 0x00007044: TODO!!!\n");
#endif
                //TODO!!!
            }
            //loc_7160
            HW_Write16(r4, 0x100 + r7, sl | (r0 << 11));

            MENTOR_LoadFIFO(r4, ep, r6->xfer_buffer, r5);

            HW_Write16(r4, 0x102 + r7, 
                (sb & ~0x9400) | 0x2080 | 0x27);
        }
    }
    //loc_71bc
}


/* 0x00006cc0 - todo */
void MENTOR_RestartEtd(struct Mentor_Controller* r4, 
    struct _musb_transfer* r6)
{
#if 0
    fprintf(stderr, "MENTOR_RestartEtd: TODO!!!\n");
#endif

    int fp_0x30;
    //fp_0x2c = _GLOBAL_OFFSET_TABLE_;

    struct Struct_0xa4* r8 = r6->Data_0x30;

#if 0
    fprintf(stderr, "MENTOR_RestartEtd: r8=%p, r8->Data_0x28=%d\n",
        r8, r8->Data_0x28);
#endif

    if (r8->Data_0x28 >= 0)
    {
        //0x00006cf4
        r8->bData_0x1f = 0;

        fp_0x30 = r8->Data_0x28;
        r4->Data_0xc4[fp_0x30] = r6;
        r6->flags |= 0x100;

        int r7 = fp_0x30 * 16;

        uint16_t wCsr;
        int retry/*r5*/ = 1000;
        while (((wCsr = HW_Read16(r4, 0x102 + r7)) & 0x03) && retry--)
        {
            //loc_6d68
            nanospin_ns(1000);
        }

        if (retry <= 0)
        {
            //loc_6d9c
            mentor_slogf(r4, 12, 2, 1, 
                " %s : MENTOR_RestartEtd - %s: TX FIFO still not Empty (%x)",
                "devu-dm816x-mg.so", "MENTOR_RestartEtd", wCsr);
        }
        //loc_6de0
        int r5 = r6->xfer_length - r6->bytes_xfered;

#if 0
        fprintf(stderr, "MENTOR_RestartEtd: r5=%d, r6->flags=0x%x\n",
            r5, r6->flags);
#endif

        if ((r6->flags & 0x400) &&
            (r4->flags & 0x200) &&
            (r5 > r8->wData_0x18) &&
            ((r8->wData_0x18 & 0x3f) == 0) &&
            (r8->transferType == USB_ATTRIB_BULK)) //2))
        {
            //0x00006e24
            r6->Data_0x10 = r5;
            r6->flags |= 0x800;
            //->loc_6e58
        }
        else
        {
            //loc_6e38
            r6->flags &= ~0x800;
            r6->Data_0x10 = (r5 > r8->Data_0x30->Data_0)?
                r8->Data_0x30->Data_0: r5;
        }
        //loc_6e58
        if (r6->flags & 0x04)
        {
            //0x00006e64
            int sb = HW_Read16(r4, 0x106 + r7);
#if 0
            fprintf(stderr, "MENTOR_RestartEtd: 0x106 -> 0x%x\n", sb);
#endif

            if ((r8->transferType == USB_ATTRIB_ISOCHRONOUS/*1*/) || 
                (r8->transferType == USB_ATTRIB_INTERRUPT/*3*/))
            {
                sb |= (1 << 12); //0x1000; /* PID Error ?*/
            }

            if (r6->flags & 0x800)
            {
                //0x00006e94
                HW_Write16(r4, 0x104 + r7, r8->wData_0x18);
                HW_Write16(r4, 0x106 + r7, sb & 0x2792);

                if (r6->flags & 0x400)
                {
                    //0x00006ec8
#if 1
                    fprintf(stderr, "MENTOR_RestartEtd: 0x00006ec8: TODO!!!\n");
#endif
                    //TODO!!!
                }
                //loc_6f00
                HW_Write16(r4, 0x106 + r7, 
                    HW_Read16(r4, 0x106 + r7) | 0x2040 | 0x2d);
                //->loc_71bc
            } //if (r6->flags & 0x800)
            else
            {
                //loc_6f24
                int fp_0x34;
                int fp_0x2c;

                fp_0x34 = fp_0x2c = r8->wData_0x18;
                int r0 = r6->Data_0x10 / r8->wData_0x18;
                int r3;
                if ((r0 - 1) <= 0)
                {
                    r3 = 0;
                    //->loc_6f58
                }
                else
                {
                    r3 = (r6->Data_0x10 / fp_0x34) - 1;
                }
                //loc_6f58: write RXMAXP
                HW_Write16(r4, 0x104 + r7, fp_0x2c | (r3 << 11));

                int sl;
                if ((r6->flags & 0x400) == 0)
                {
                    sl = sb & 0x9fff;
                    //->loc_6fc8
                }
                else
                {
                    //0x00006f84
                    sl = sb & 0x2792;
                    sl |= 0x6000;

                    mentor_start_dma_transfer(r4,
                        r8,
                        r6,
                        1,
                        fp_0x30,
                        r8->Data_0x2c,
                        r6->Data_8 + r6->bytes_xfered,
                        r5);
                }
                //loc_6fc8: write RxCSR
                HW_Write16(r4, 0x106 + r7, sl | 0x6d); //01101101
                    //Clear: RxStall, DataError/NAK Timeout, Error, RxPktRdy
                    //Set: ReqPkt
            }
            //->loc_71bc
        } //if (r6->flags & 0x04)
        else
        {
            //loc_6fe4
            int32_t r0 = r6->Data_0x10;
            uint32_t sl = r8->wData_0x18;
            r0 = r0 - 1;
            r0 = r0 + sl;
            r0 = r0 / sl;
            r0 = r0 - 1;
            if (r0 <= 0)
            {
                r0 = 0; 
                //->loc_7024
            }
            else
            {
                //0x0000700c
                r0 = r6->Data_0x10;
                r0 = r0 - 1;
                r0 = r0 + sl;
                r0 = r0 / sl;
                r0 = r0 - 1;
            }
            //loc_7024
            int sb = HW_Read16(r4, 0x102 + r7);

            if (r6->flags & 0x600)
            {
                //0x00007044
#if 1
                fprintf(stderr, "MENTOR_RestartEtd: 0x00007044: TODO!!!\n");
#endif
                //TODO!!!
            }
            //loc_7160
            HW_Write16(r4, 0x100 + r7, sl | (r0 << 11));

            MENTOR_LoadFIFO(r4, fp_0x30, r6->xfer_buffer, r5);

            HW_Write16(r4, 0x102 + r7, 
                (sb & ~0x9400) | 0x2080 | 0x27);
        }
    }
    //loc_71bc
}


/* 0x000025c8 - todo */
int mentor_start_dma_transfer(struct Mentor_Controller* r0, 
    struct Struct_0xa4* r1, struct _musb_transfer* r2, int r3_,
    int r4/*sp_0x2c*/, int f/*sp_0x30*/, int r6/*sp_0x34*/, uint32_t r5/*sp_0x38*/)
{
#ifdef MB86H60

    fprintf(stderr, "mentor_start_dma_transfer: rx=%d, ep=%d, f=%d, r6=0x%x, r5=%d\n",
        r3_, r4, f, r6, r5);

    int channel = 3;
    int ch_offset = 0x40 * channel;

    uint32_t fifo_addr = 0x880 + (r4/*bEndpoint*/ << 4);
    uint32_t maxPacketSize = 512;
    uint32_t line = r5 / maxPacketSize;

    if (r3_)
    {
        //rx
        dma_SetUsbMode_PacedEpReadChannel(r0, r4);

        ((volatile uint32_t*)(dma_regs))[(MB86H60_DMA_CH_LENGTH + ch_offset)/sizeof(uint32_t)] = r5;
        ((volatile uint32_t*)(dma_regs))[(MB86H60_DMA_CH_LLADDR + ch_offset)/sizeof(uint32_t)] = 0;
        ((volatile uint32_t*)(dma_regs))[(MB86H60_DMA_CH_RDADDR + ch_offset)/sizeof(uint32_t)] = fifo_addr;
        ((volatile uint32_t*)(dma_regs))[(MB86H60_DMA_CH_RDLINE + ch_offset)/sizeof(uint32_t)] = 0;
        ((volatile uint32_t*)(dma_regs))[(MB86H60_DMA_CH_RDINC + ch_offset)/sizeof(uint32_t)] = 4;
        ((volatile uint32_t*)(dma_regs))[(MB86H60_DMA_CH_RDLPADDR + ch_offset)/sizeof(uint32_t)] = fifo_addr;
        ((volatile uint32_t*)(dma_regs))[(MB86H60_DMA_CH_WRADDR + ch_offset)/sizeof(uint32_t)] = r6;
        ((volatile uint32_t*)(dma_regs))[(MB86H60_DMA_CH_WRLINE + ch_offset)/sizeof(uint32_t)] = line;
        ((volatile uint32_t*)(dma_regs))[(MB86H60_DMA_CH_WRINC + ch_offset)/sizeof(uint32_t)] = maxPacketSize;
        ((volatile uint32_t*)(dma_regs))[(MB86H60_DMA_CH_WRLPADDR + ch_offset)/sizeof(uint32_t)] = 0;

        uint32_t dwConfig = (0x07 << 8) | (1 << 2);

        ((volatile uint32_t*)(dma_regs))[(MB86H60_DMA_CH_CONFIG + ch_offset)/sizeof(uint32_t)] = dwConfig;
    }
    else
    {
        //tx
        dma_SetUsbMode_PacedEpWriteChannel(r0, r4);

        //TODO!!!
    }

#else

    struct Struct_0xe4* ip = r0->Data_0xe4;

    InterruptLock(&r0->Data_0xd0);


    struct
    {
        int Data_0; //0
        int Data_4; //4
        int Data_8; //8
        int Data_0xc; //0xc
        int Data_0x10; //0x10
        int Data_0x14; //0x14
        int Data_0x18; //0x18
        int Data_0x1c; //0x1c
        int fill_0x20[2]; //0x20
        int Data_0x28; //0x28
        struct _musb_transfer* Data_0x2c; //0x2c
        struct Struct_0xa4* Data_0x30; //0x30
        struct
        {
            int fill_0[14]; //0
            int Data_0x38; //0x38
            //???
        }* Data_0x34; //0x34
        struct
        {
            int Data_0; //0
            //???
        }* Data_0x38; //0x38
        //???
    }* r3 = ip->Data_0x18.lh_first;

    if (r3 == NULL)
    {
        //0x00002624
        InterruptUnlock(&r0->Data_0xd0);
        return 12; //->0x000028d8
    }
    //0x00002640    
    if (r3->Data_0x34 != NULL)
    {
        r3->Data_0x34->Data_0x38 = r3->Data_0x38;
    }
    r3->Data_0x38->Data_0 = r3->Data_0x34;

    if ((r3->Data_0x34 = ip->Data_0x1c.lh_first) != NULL)
    {
        ip->Data_0x1c.lh_first->link.le_prev = &r3->Data_0x34;
    }
    ip->Data_0x1c.lh_first = r3;
    r3->Data_0x38 = &ip->Data_0x1c;

    InterruptUnlock(&r0->Data_0xd0);

    int r7_;
    int r8_;

    if ((r2->Data_0x34->direction & 0x80) == 0)
    {
        //0x000026a8
        InterruptLock(&r0->Data_0xd0);

        int sl = *((volatile uint32_t*)((uint8_t*)(ip->Data_0) + 0x74));

        int sp;        
