
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <stdarg.h>
#include <unistd.h>
#include <errno.h>
#include <gulliver.h>
#include <sys/mman.h>
#include <sys/neutrino.h>
#include <sys/netmgr.h>
#include <sys/slog.h>
#include <sys/usbdi.h>
#include <pthread.h>
#include <arm/mb86h60.h>


//_GLOBAL_OFFSET_TABLE_ //0x0000bd5c

struct Mentor_Controller;
#define USB_CONTROLLER_PRIV_T struct Mentor_Controller
#include <sys/io-usb.h>
#include "my-io-usb.h"



struct Struct_0xa4;
struct Struct_0xa0;
struct Struct_0x94
{
    struct Struct_0xa0* Data_0; //0
};

struct Struct_0xa0
{
    volatile uint32_t Data_0; //0
    volatile uint32_t flags; //4
    int Data_8; //8
    void* pData; //0xc
    int Data_0x10; //0x10
    volatile uint32_t Data_0x14; //0x14
    int fill_0x18[4]; //0x18
    int status; //0x28
    struct Struct_0x94 Data_0x2c; //0x2c
    struct Struct_0xa4* Data_0x30; //0x30
    struct Struct_10bab4* Data_0x34; //0x34
    void (*Func_0x38)(); //0x38
    void (*Data_0x3c)(); //0x3c
    int fill_0x40; //0x40
    //0x44
};


struct Struct_0xa4
{
    struct Struct_0xa4* Data_0; //0
    struct Struct_0xa4* Data_4; //4
    struct Struct_0xa0* Data_8__; //8
    struct Struct_0x94* Data_0xc; //12
    int Data_0x10; //0x10 = 16
    int Data_0x14; //0x14 = 20
    uint16_t wData_0x18; //0x18 = 24
    uint8_t transferType; //0x1a = 26
    uint8_t bData_0x1b; //0x1b = 27
    uint8_t bData_0x1c; //0x1c = 28
    uint8_t bData_0x1d; //0x1d = 29
    uint8_t bData_0x1e; //0x1e = 30
    uint8_t bData_0x1f; //0x1f = 31
    int Data_0x20; //0x20
    int Data_0x24; //0x24
    int Data_0x28; //0x28
    int Data_0x2c; //0x2c
    struct fp_0x34_Inner_0x18_Inner_0x10* Data_0x30; //0x30
    struct Struct_112b08* Data_0x34; //0x34
    int Data_0x38; //0x38
    int fill_0x3c; //0x3c
    //0x40 = 64
};
    

struct Struct_0xe4
{
    int Data_0; //0
    void* Data_4; //4
    int fill_8; //8
    uint8_t bData_0xc; //0xc
    int Data_0x10; //0x10
    int fill_0x14[3]; //0x14
    //0x20
};


struct Mentor_Controller_Inner_0x8c
{
    int fill_0[6]; //0
    struct fp_0x34_Inner_0x18
    {
        int fill_0[2]; //8
        int Data_8; //8
        uint32_t Data_0xc; //12 = 0xc
        struct fp_0x34_Inner_0x18_Inner_0x10
        {
            int Data_0; //0
            int Data_4; //4
            int Data_8; //8
            struct fp_0x34_Inner_0x18* Data_0xc; //0xc 
            //16 = 0x10
        }* Data_0x10; //16 = 0x10
        //0x14
    } Data_0x18[]; //0x18, size???
    //???
};


struct Mentor_Controller
{
    struct USB_Controller* Data_0; //0
    pthread_mutex_t Data_4; //4
    pthread_mutex_t Data_0xc; //12
    void* Data_0x14; //0x14
    uint32_t Data_0x18; //0x18
    int fill_ox1c[3]; //0x1c
    int Data_0x28; //0x28
    int Data_0x2c; //0x2c
    int fill_0x30[2]; //0x30
    int Data_0x38; //0x38
    pthread_t Data_0x3c; //0x3c
    int Data_0x40; //0x40
    int Data_0x44; //0x44
    int Data_0x48; //0x48
    int Data_0x4c; //0x4c
    int Data_0x50; //0x50
    int Data_0x54; //0x54
    int Data_0x58; //0x58
    struct sigevent Data_0x5c;
    int Data_0x6c; //0x6c
    uint32_t Data_0x70; //0x70
    uint32_t Data_0x74; //0x74
    uint32_t verbosity; //0x78
    int Data_0x7c; //0x7c
    int fill_0x80; //0x80
    int Data_0x84; //0x84
    char* fconfig_string; //0x88
    struct Mentor_Controller_Inner_0x8c* Data_0x8c; //0x8c
    struct Struct_0x94 Data_0x90; //0x90
    struct Struct_0x94* Data_0x94; //0x94
    struct Struct_0xa0* Data_0x98; //0x98
    struct Struct_0xa0** Data_0x9c; //0x9c
    struct Struct_0xa0* Data_0xa0; //0xa0
    struct Struct_0xa4* Data_0xa4; //0xa4
    struct Struct_0xa4* Data_0xa8; //0xa8
    struct Struct_0xa4* Data_0xac; //0xac
    struct Struct_0xa4* Data_0xb0; //0xb0
    struct Struct_0xa4* Data_0xb4; //0xb4
    struct Struct_0xa4* Data_0xb8; //0xb8
    struct Struct_0xa4* Data_0xbc; //0xbc
    struct Struct_0xa4* Data_0xc0; //0xc0
    struct Struct_0xa0** Data_0xc4; //0xc4
    struct Struct_0xa4** Data_0xc8; //0xc8
    int fill_0xcc; //0xcc
    struct intrspin Data_0xd0; //0xd0
    uint16_t wData_0xd4; //0xd4
    struct Struct_0xe4* Data_0xe4; //0xe4
    //0xe8
};

#include "mentor.h"
#include "mu_hdrdf.h"


extern void MENTOR_LoadFIFO(struct Mentor_Controller*, uint16_t, int, uint16_t);
extern void MENTOR_ReadFIFO(struct Mentor_Controller*, struct Struct_0xa0*, uint16_t, int, uint16_t);


#ifdef MB86H60

volatile uint8_t bUsbIntStatus;

void* dma_regs = NULL;
uint32_t dma_dwUsbMode = 0;


void dma_SetUsbIntMask(struct Mentor_Controller* c, int a)
{
    ((volatile uint32_t*)(dma_regs))[MB86H60_DMA_USB_INT_MASK/sizeof(uint32_t)] = a;
}

uint32_t dma_GetUsbIntStatus(struct Mentor_Controller* c)
{
    return ((volatile uint32_t*)(dma_regs))[MB86H60_DMA_USB_INT_STATUS/sizeof(uint32_t)];
}

void dma_SetUsbIntClear(struct Mentor_Controller* c, int a)
{
    ((volatile uint32_t*)(dma_regs))[MB86H60_DMA_USB_INT_CLEAR/sizeof(uint32_t)] = a;
}

void dma_SetUsbMode_LengthInput(struct Mentor_Controller* c, int a)
{
	int mask = MB86H60_DMA_USB_MODE_LENGTH_INPUT;
	a = (a << 1) & mask;

